In [1]:
!conda install pandas
# packages ko install karta h

Unable to create process using 'C:\Users\Ankit Kumar\anaconda3\python.exe "C:\Users\Ankit Kumar\anaconda3\Scripts\conda-script.py" install pandas'

In [2]:
# pandas mein 2 types k data structures hote h
# Series
# DataFrame

In [4]:
import pandas as pd

In [6]:
s = pd.Series([1,2,3,4,5])
s
# pandas k andar series ek labeld array hota h
# aur list ek unlabeld array hota h

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
s = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
s
# by default 0 se indexing start hoti h pr custom index diya ja sakta h

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
df = pd.DataFrame({"names": ["Ankit","Rohan","Shubham"],"marks":[70, 64, 56]})
df

     names  marks
0    Ankit     70
1    Rohan     64
2  Shubham     56

In [16]:
df = pd.read_csv("marks_table.csv")
df
# data ko read karta h

          Name  Physics  Chemistry  Maths  Average
0       Madhav       91        100     96      NaN
1          Ram       95         93     90      NaN
2     Vishakha       91         95     92      NaN
3          Sam       71         89     64      NaN
4      Rishabh       64         77     90      NaN
5  Total Marks      412        454    432      NaN

In [17]:
df.head()
# data k shuru k 5 row dikhata h

       Name  Physics  Chemistry  Maths  Average
0    Madhav       91        100     96      NaN
1       Ram       95         93     90      NaN
2  Vishakha       91         95     92      NaN
3       Sam       71         89     64      NaN
4   Rishabh       64         77     90      NaN

In [18]:
df.tail()
# last k 5 row

          Name  Physics  Chemistry  Maths  Average
1          Ram       95         93     90      NaN
2     Vishakha       91         95     92      NaN
3          Sam       71         89     64      NaN
4      Rishabh       64         77     90      NaN
5  Total Marks      412        454    432      NaN

In [19]:
df.describe() # data columns k naam dikhata h

          Physics   Chemistry       Maths  Average
count    6.000000    6.000000    6.000000      0.0
mean   137.333333  151.333333  144.000000      NaN
std    135.133514  148.478506  141.551404      NaN
min     64.000000   77.000000   64.000000      NaN
25%     76.000000   90.000000   90.000000      NaN
50%     91.000000   94.000000   91.000000      NaN
75%     94.000000   98.750000   95.000000      NaN
max    412.000000  454.000000  432.000000      NaN

In [20]:
# df.info() data columns k naame + data type aur extra info dikhata h

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       6 non-null      object
 1   Physics    6 non-null      int64
 2   Chemistry  6 non-null      int64
 3   Maths      6 non-null      int64
 4   Average    0 non-null      float64
dtypes: float64(1), int64(3), object(1)
memory usage: 372.0+ bytes

In [21]:
df["Name"]
# specific column ka data dikhata h

0         Madhav
1            Ram
2       Vishakha
3            Sam
4        Rishabh
5    Total Marks
Name: Name, dtype: object

In [25]:
type(df["Name"])
# specific column ka naam dikhata h

pandas.core.series.Series

In [26]:
df[["Name","Chemistry"]]
# multiple columns k naam dikhata h

          Name  Chemistry
0       Madhav        100
1          Ram         93
2     Vishakha         95
3          Sam         89
4      Rishabh         77
5  Total Marks        454

In [30]:
df.iloc[1]
# column k naam k first data ko row me dikhata h

Name         Ram
Physics       95
Chemistry     93
Maths         90
Average      NaN
Name: 1, dtype: object

In [29]:
type(df.iloc[0])

pandas.core.series.Series

In [34]:
df.dropna()

Empty DataFrame
Columns: [Name, Physics, Chemistry, Maths, Average]
Index: []

In [33]:
df.head()

       Name  Physics  Chemistry  Maths  Average
0    Madhav       91        100     96      NaN
1       Ram       95         93     90      NaN
2  Vishakha       91         95     92      NaN
3       Sam       71         89     64      NaN
4   Rishabh       64         77     90      NaN

In [55]:
df.fillna(50.5, inplace=True)
# original data ko change kardega

In [41]:
df.fillna(0)
# null values ko 0 se replace kar dega

          Name  Physics  Chemistry  Maths  Average
0       Madhav       91        100     96      0.0
1          Ram       95         93     90      0.0
2     Vishakha       91         95     92      0.0
3          Sam       71         89     64      0.0
4      Rishabh       64         77     90      0.0
5  Total Marks      412        454    432      0.0

In [45]:
df.rename(columns={"Maths": "Mathmatics"}, inplace = True)
df

          Name  Physics  Chemistry  Mathmatics  Average
0       Madhav       91        100          96      NaN
1          Ram       95         93          90      NaN
2     Vishakha       91         95          92      NaN
3          Sam       71         89          64      NaN
4      Rishabh       64         77          90      NaN
5  Total Marks      412        454         432      NaN

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Physics     6 non-null      int64
 2   Chemistry   6 non-null      int64
 3   Mathmatics  6 non-null      int64
 4   Average     0 non-null      float64
dtypes: float64(1), int64(3), object(1)
memory usage: 372.0+ bytes

In [57]:
df['Average'] = df['Average'].astype(int)
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Physics     6 non-null      int64
 2   Chemistry   6 non-null      int64
 3   Mathmatics  6 non-null      int64
 4   Average     6 non-null      int32
dtypes: int32(1), int64(3), object(1)
memory usage: 348.0+ bytes

       Name  Physics  Chemistry  Mathmatics  Average
0    Madhav       91        100          96       50
1       Ram       95         93          90       50
2  Vishakha       91         95          92       50
3       Sam       71         89          64       50
4   Rishabh       64         77          90       50

In [58]:
df["Name"][0]
# specific column ka 1 data dikhata h

'Madhav'

In [59]:
len(df)
# data ki rows dikhata h

6

In [61]:
df["zeros"] = [0 for i in range(len(df))]
df
# ek naya column ad kar dega

          Name  Physics  Chemistry  Mathmatics  Average  zeros
0       Madhav       91        100          96       50      0
1          Ram       95         93          90       50      0
2     Vishakha       91         95          92       50      0
3          Sam       71         89          64       50      0
4      Rishabh       64         77          90       50      0
5  Total Marks      412        454         432       50      0

In [70]:
def fx(a):
    return a * a
df["zeros+1"] = df["Average"].apply(fx)
df
# ek naye column me Physics column k data ka square add karta h

          Name  Physics  Chemistry  Mathmatics  Average  zeros  zeros+1
0       Madhav       91        100          96       50      0     2500
1          Ram       95         93          90       50      0     2500
2     Vishakha       91         95          92       50      0     2500
3          Sam       71         89          64       50      0     2500
4      Rishabh       64         77          90       50      0     2500
5  Total Marks      412        454         432       50      0     2500

In [72]:
df.to_csv("update.csv")
# ees csv file ko save karta h but ek alag indexing column banata h 
# jo 0 se start hota h

In [74]:
df.to_csv("update.csv", index=False)
# ab extra index column nhi dega

In [78]:
 df1 = pd.DataFrame({
     "name":["ankit","rohan","shubham","shivam","divya","aparna","khusi"],
     "marks":[100,34,63,23,73,63,94]
 })
df1
# ek naya dataframe banata h with row aur columns

      name  marks
0    ankit    100
1    rohan     34
2  shubham     63
3   shivam     23
4    divya     73
5   aparna     63
6    khusi     94

In [79]:
 df2 = pd.DataFrame({
     "name":["ankit","rohini","dukhi"],
     "marks":[100,34,63]
 })
df2

     name  marks
0   ankit    100
1  rohini     34
2   dukhi     63

In [81]:
pd.concat([df1, df2])
# dataframe or columns ko concate karta h

      name  marks
0    ankit    100
1    rohan     34
2  shubham     63
3   shivam     23
4    divya     73
5   aparna     63
6    khusi     94
0    ankit    100
1   rohini     34
2    dukhi     63

In [82]:
 df3 = pd.DataFrame({
     "name":["ankit","rohini","dukhi"],
     "rollno.":[10,34,63]
 })
df3

     name  marks
0   ankit    100
1  rohini     34
2   dukhi     63

In [84]:
pd.merge(df1, df2, on="name")

    name  marks_x  marks_y
0  ankit      100      100